export class Constant {


    // header dialog-search
  public HEADER_DIALOG_SEARCH = {
    typeAccountCode: ['เลือก', 'เลขที่บัญชีแยกประเภททั่วไป', 'คำอธิบาย'],
    centerCode: ['เลือก', 'รหัสศูนย์ต้นทุน', 'ชื่อทั่วไป', 'คำอธิบาย', 'รหัสหน่วยงาน', 'รหัสหน่วยเบิกจ่าย', 'รหัสพื้นที่'],
    areaCode: ['เลือก', 'รหัสพื้นที่', 'ชื่อ', 'คำอธิบาย'],
    budgetFundCenter: ['เลือก','หน่วยรับงบประมาณ','ชื่อ','คำอธิบาย'],
    sourceMoneyCode: ['เลือก', 'รหัสแหล่งของเงิน', 'ชื่อ', 'คำอธิบาย'],
    sourceBudgetCode: ['เลือก', 'รหัสงบประมาณ', 'ชื่อ', 'คำอธิบาย'],
    sourceBudgetCode2: ['เลือก', 'รหัสงบประมาณ', 'คำอธิบาย', 'รหัสแหล่งของเงิน', 'รายการผูกพันงบประมาณ'],
    mainActivityCode: ['เลือก', 'รหัสกิจกรรมหลัก', 'ชื่อของเขตฟังก์ชั่น'],
    subActivityCode: ['เลือก', 'รหัสกิจกรรมย่อย', 'ชื่อทั่วไป', 'ข้อความแบบยาว', 'รหัสหน่วยงาน'],
    subAccountCode: ['เลือก', 'รหัสบัญชีย่อย', 'คำอธิบาย', 'เจ้าของบัญชีย่อย', 'ประเภท/หมวด'],
    packageCode: ['เลือก', 'รหัสหมวดพัสดุ', 'รายละเอียด'],
    bankBranch: ['เลือก', 'รหัสประเทศของธนาคาร', 'คีย์ธนาคาร', 'ชื่อธนาคาร', 'แผนงบประมาณ', 'ถนน', 'สาขาธนาคาร'],
    depositAccount: ['เลือก', 'รหัสบัญชีเงินฝาก', 'ชื่อบัญชี', 'เจ้าของบัญชีเงินฝาก', 'ประเภท/หมวด'],
    gpscCode: ['เลือก', 'GPSC', 'คำอธิบาย GPSC', 'กลุ่มวัสดุ'],
    vendorTaxId: ['เลือก', 'รหัสประจำตัวผู้เสียภาษี', 'รหัสผู้ขาย', 'ชื่อผู้ขาย'],
    vendorBankAccount: [
      'เลือก',
      'เลขที่บัญชีเงินฝากธนาคาร',
      'Key ธนาคาร',
      'ลำดับที่',
      // 'รหัสผู้ขาย',
      'รหัสประจำตัวผู้เสียภาษี(ผู้ขาย)',
      'ชื่อผู้ขาย',
      'Block',
    ],
    assetCode: ['เลือก', 'หมวดสินทรัพย์', 'ชื่อหมวดสินทรัพย์-ข้อความแบบย่อ', 'การกำหนดบัญชี', 'คำอธิบายของการกำหนดบัญชี'],
    unit: ['เลือก', 'หน่วยนับ', 'ข้อความหน่วยนับ(ไม่เกิน 10 ตัวอักษร)', 'ข้อความหน่วยนับ(ไม่เกิน 30 ตัวอักษร)'],
    incomeCode: ['เลือก', 'รหัสรายได้', 'ชื่อรายได้', 'ตั้งแต่่รหัสบัญชีแยกประเภท', 'ถึงรหัสบัญชีแยกประเภท'],
    bankBook: ['เลือก', 'รหัสหน่วยงาน', 'BANK BOOK', 'Short Description', 'Long Description'],
    sideList: ['เลือก', 'รหัสข้อมูลหลักด้าน-รายการ', 'ZTXREF1TXT'],
    budgetReserve: ['เลือก', 'รหัสเอกสารสำรองเงินงบประมาณ', 'ส่วนหัวเอกสาร', 'ประเภทเอกสารการบันทึกเอกสารโดยผู้ใช้', 'รหัสหน่วยงาน'],
  };
}